#1.py
#동양미래대
#파이썬 프로그래밍
'''이것은 
여러줄 이루어진
주석입니다.
'''


print("hello 'world'!!" * 3 )
print('hello "world"!!')
print("파이썬" + "만세")
print("파이썬"+"만"+"세"+"!!!")
print("파이썬 !!!" * 3)

print(type("hello"))

print(3)
print(1.1)
print(type(3))
print(type(1.1))

print(1,2,-5,3.14,2.71828)
print('Hi,','Pyton')

print('23000원은','5000원?개',"1000원?개")
print('5000원',23000//5000,'개')
print('1000원',(23000%5000)//1000,'개')

print(eval('3 + 15 / 2'))
print(eval('4 * 3 % 5'))
print(eval('3 * -2 ** 3'))
print(eval('"java"*3'))

print(eval('1 + 62 -3 * 52'))
print(eval('256 * 553 -152'))
print(eval('(162353890930//539853)+(162353890930%539853)'))

print('78000원의','5만원권은',78000//50000,'개')
print('1만원권은',(78000%50000)//10000,'개')
print('5천원권은',((78000%50000)%10000)//5000,'개')
print('1천원권은',(((78000%50000)%10000)%5000)//1000,'개')